{
    "title": "Frontend Developer",
    "description": "This is a simple example of using JSON in a React app.",
    "projects": [
        {
            "id": "wms",
            "url": "",
            "url_text": "Since the website was developed for a specific client, it is not accessible for public viewing.",
            "name": "Warehouse Management System",
            "role": "Front end developer",
            "description": "I contributed to the development of a warehouse management system as part of a two-person front-end team, using React and Polaris UI, focusing on product-related features such as adding products with image upload, editing, and managing product details. \nI also worked on sections like orders, where different order states required specific functionalities, and handled user and location settings. \nAdditionally, I implemented role-based access control to ensure appropriate access to sections of the site based on user roles. \n\nTo maintain UI consistency, I used a combination of MUI and Polaris components, along with custom components where necessary. I created reusable custom hooks for features such as table filters and pagination, and employed React Hook Form for efficient form management. \n\n For API integration, I utilized Postman and Swagger, collaborating closely with the back-end team to ensure smooth communication and functionality. \nI also optimized performance using SWR and the Polaris table component to minimize re-renders and reduce repetitive API calls.",
            "src": [
                "/images/wms/1.png",
                "/images/wms/2.png",
                "/images/wms/3.png",
                "/images/wms/4.png"
            ],
            "main_image": "/images/wms/main.png",
            "technologies": [
                "React",
                "Polaris (Shopify UI)",
                "MUI",
                "SWR",
                "React Form Hook",
                "React Router",
                "Postman"
            ],
            "tags": [
                "Front end"
            ],
            "year": "2024",
            "company": "MXN Commerce Inc."
        },
        {
            "id": "kravebeauty",
            "name": "KRAVEBEAUTY",
            "role": "Front End Developer",
            "url": "https://kravebeauty.co.kr/",
            "url_text": "https://kravebeauty.co.kr/",
            "description": "Utilized the client's Figma design files to develop and refine the design and functionality of key pages and components, including navigation, login and registration pages, and the shopping cart. \n\nManaged the complete data migration from Cafe24 to Shopify platform, which was also integrated with third-party delivery and shopping applications. \n\nCreated and administered an AWS EC2 instance to host the application code, specifically accommodating Korean address input with Juso API.",
            "src": [
                "/images/kravebeauty/1.png",
                "/images/kravebeauty/2.png",
                "/images/kravebeauty/3.png",
                "/images/kravebeauty/4.png"
            ],
            "main_image": "/images/kravebeauty/main.png",
            "technologies": [
                "Shopify (platform)",
                "Liquid",
                "JS (ES6), HTML5, CSS3",
                "AWS instance",
                "WHOIS domain"
            ],
            "tags": [
                "Front end"
            ],
            "year": "2022",
            "company": "Punch Digital Marketing"
        },
        {
            "id": "mobick-mania-website",
            "url": "https://mobickmania.com/",
            "url_text": "https://mobickmania.com/",
            "name": "Mobick Mania Website",
            "role": "Front end developer and designer",
            "description": "The Mobick Mania website serves as a promotional platform for a cryptocurrency exchange mobile application. \n\n I designed the website using Figma, leveraging 3D plugins to create realistic mockups. \nFor the technical implementation, I used React.js along with MUI components to build a static website encompassing a landing page, a step-by-step tutorial for app usage, and a contact form integrated with EmailJS.\nAdditionally, I deployed the website using Netlify, setting up a custom URL to enhance accessibility and branding.\n\nTo ensure the security and efficiency of real-time cryptocurrency data, I developed a separate Next.js application for retrieving and displaying live prices and trade statistics. This Next.js application, which includes both front-end and back-end, is embedded within the promotional website. The back-end team provided the EC2 instance, into which I deployed the Next.js application using terminal. This separation adds an extra layer of protection for the server from which real-time data is fetched and allows for the reusability of the data retrieval application across various platforms.\n\n",
            "src": [
                "/images/mobick-mania-website/1.png",
                "/images/mobick-mania-website/2.png",
                "/images/mobick-mania-website/3.png",
                "/images/mobick-mania-website/4.png",
                "/images/mobick-mania-website/5.png"
            ],
            "main_image": "/images/mobick-mania-website/main.png",
            "technologies": [
                "React",
                "Next.js (for embedded application)",
                "MUI",
                "Figma",
                "JS(ES6), HTML5, CSS3",
                "EmailJS",
                "Netlify"
            ],
            "tags": [
                "Front end",
                "UI UX Design"
            ],
            "year": "2023",
            "company": "BetweenBits Inc."
        },
        {
            "id": "test",
            "name": "KRAVEBEAUTY",
            "role": "Front End Developer",
            "url": "https://kravebeauty.co.kr/",
            "description": "Using client’s Figma Design files, worked on the design and functionality of specific pages and components. Integrated Shopify store with third party delivery and shopping apps. Worked on data transfer as a part of full data migration between different platforms. Created and managed AWS ec2 instance as a server for the application code. Installed SSL and deployed application code to the running server.",
            "src": [
                "/images/3.jpg"
            ],
            "main_image": "/images/3.jpg",
            "technologies": [
                "Shopify (platform)",
                "Liquid",
                "JS(ES6), HTML5, CSS3",
                "AWS instance",
                "WHOIS domain"
            ],
            "tags": [
                "Front end"
            ],
            "year": "2022",
            "company": "Punch Digital Marketing"
        },
        {
            "id": "test2",
            "name": "KRAVEBEAUTY",
            "role": "Front End Developer",
            "url": "https://kravebeauty.co.kr/",
            "description": "Using client’s Figma Design files, worked on the design and functionality of specific pages and components. Integrated Shopify store with third party delivery and shopping apps. Worked on data transfer as a part of full data migration between different platforms. Created and managed AWS ec2 instance as a server for the application code. Installed SSL and deployed application code to the running server.",
            "src": [
                "/images/3.jpg"
            ],
            "main_image": "/images/3.jpg",
            "technologies": [
                "Shopify (platform)",
                "Liquid",
                "JS(ES6), HTML5, CSS3",
                "AWS instance",
                "WHOIS domain"
            ],
            "tags": [
                "Front end"
            ],
            "year": "2022",
            "company": "Punch Digital Marketing"
        }
    ]
}